Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz8110ca90176.h
#define PIN_PD03D_SERCOM3_PAD0                     _UINT32_(99)
#define MUX_PD03D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PD03D_SERCOM3_PAD0                  ((PIN_PD03D_SERCOM3_PAD0 << 16) | MUX_PD03D_SERCOM3_PAD0)
#define PORT_PD03D_SERCOM3_PAD0                    (_UINT32_(1) << 3)

#define PIN_PC13D_SERCOM3_PAD1                     _UINT32_(77)
#define MUX_PC13D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PC13D_SERCOM3_PAD1                  ((PIN_PC13D_SERCOM3_PAD1 << 16) | MUX_PC13D_SERCOM3_PAD1)
#define PORT_PC13D_SERCOM3_PAD1                    (_UINT32_(1) << 13)

#define PIN_PD04D_SERCOM3_PAD1                     _UINT32_(100)
#define MUX_PD04D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PD04D_SERCOM3_PAD1                  ((PIN_PD04D_SERCOM3_PAD1 << 16) | MUX_PD04D_SERCOM3_PAD1)
#define PORT_PD04D_SERCOM3_PAD1                    (_UINT32_(1) << 4)

#define PIN_PC14D_SERCOM3_PAD2                     _UINT32_(78)
#define MUX_PC14D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PC14D_SERCOM3_PAD2                  ((PIN_PC14D_SERCOM3_PAD2 << 16) | MUX_PC14D_SERCOM3_PAD2)
#define PORT_PC14D_SERCOM3_PAD2                    (_UINT32_(1) << 14)

#define PIN_PD05D_SERCOM3_PAD2                     _UINT32_(101)
#define MUX_PD05D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PD05D_SERCOM3_PAD2                  ((PIN_PD05D_SERCOM3_PAD2 << 16) | MUX_PD05D_SERCOM3_PAD2)
#define PORT_PD05D_SERCOM3_PAD2                    (_UINT32_(1) << 5)

#define PIN_PC15D_SERCOM3_PAD3                     _UINT32_(79)
#define MUX_PC15D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PC15D_SERCOM3_PAD3                  ((PIN_PC15D_SERCOM3_PAD3 << 16) | MUX_PC15D_SERCOM3_PAD3)
#define PORT_PC15D_SERCOM3_PAD3                    (_UINT32_(1) << 15)

#define PIN_PD06D_SERCOM3_PAD3                     _UINT32_(102)
#define MUX_PD06D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PD06D_SERCOM3_PAD3                  ((PIN_PD06D_SERCOM3_PAD3 << 16) | MUX_PD06D_SERCOM3_PAD3)
#define PORT_PD06D_SERCOM3_PAD3                    (_UINT32_(1) << 6)

/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_PC21D_SERCOM4_PAD0                     _UINT32_(85)
#define MUX_PC21D_SERCOM4_PAD0                     _UINT32_(3) 
#define PINMUX_PC21D_SERCOM4_PAD0                  ((PIN_PC21D_SERCOM4_PAD0 << 16) | MUX_PC21D_SERCOM4_PAD0)
#define PORT_PC21D_SERCOM4_PAD0                    (_UINT32_(1) << 21)

#define PIN_PC22D_SERCOM4_PAD1                     _UINT32_(86)
#define MUX_PC22D_SERCOM4_PAD1                     _UINT32_(3) 
#define PINMUX_PC22D_SERCOM4_PAD1                  ((PIN_PC22D_SERCOM4_PAD1 << 16) | MUX_PC22D_SERCOM4_PAD1)
#define PORT_PC22D_SERCOM4_PAD1                    (_UINT32_(1) << 22)

#define PIN_PC23D_SERCOM4_PAD2                     _UINT32_(87)
#define MUX_PC23D_SERCOM4_PAD2                     _UINT32_(3) 
#define PINMUX_PC23D_SERCOM4_PAD2                  ((PIN_PC23D_SERCOM4_PAD2 << 16) | MUX_PC23D_SERCOM4_PAD2)
#define PORT_PC23D_SERCOM4_PAD2                    (_UINT32_(1) << 23)

#define PIN_PC24D_SERCOM4_PAD3                     _UINT32_(88)
#define MUX_PC24D_SERCOM4_PAD3                     _UINT32_(3) 
#define PINMUX_PC24D_SERCOM4_PAD3                  ((PIN_PC24D_SERCOM4_PAD3 << 16) | MUX_PC24D_SERCOM4_PAD3)
#define PORT_PC24D_SERCOM4_PAD3                    (_UINT32_(1) << 24)

/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PC25D_SERCOM5_PAD0                     _UINT32_(89)
#define MUX_PC25D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PC25D_SERCOM5_PAD0                  ((PIN_PC25D_SERCOM5_PAD0 << 16) | MUX_PC25D_SERCOM5_PAD0)
#define PORT_PC25D_SERCOM5_PAD0                    (_UINT32_(1) << 25)

#define PIN_PC26D_SERCOM5_PAD1                     _UINT32_(90)
#define MUX_PC26D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PC26D_SERCOM5_PAD1                  ((PIN_PC26D_SERCOM5_PAD1 << 16) | MUX_PC26D_SERCOM5_PAD1)
#define PORT_PC26D_SERCOM5_PAD1                    (_UINT32_(1) << 26)

#define PIN_PC27D_SERCOM5_PAD2                     _UINT32_(91)
#define MUX_PC27D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PC27D_SERCOM5_PAD2                  ((PIN_PC27D_SERCOM5_PAD2 << 16) | MUX_PC27D_SERCOM5_PAD2)
#define PORT_PC27D_SERCOM5_PAD2                    (_UINT32_(1) << 27)

#define PIN_PC28D_SERCOM5_PAD3                     _UINT32_(92)
#define MUX_PC28D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PC28D_SERCOM5_PAD3                  ((PIN_PC28D_SERCOM5_PAD3 << 16) | MUX_PC28D_SERCOM5_PAD3)
#define PORT_PC28D_SERCOM5_PAD3                    (_UINT32_(1) << 28)

/* ========== PORT definition for SERCOM6 peripheral ========== */
#define PIN_PC30D_SERCOM6_PAD0                     _UINT32_(94)
#define MUX_PC30D_SERCOM6_PAD0                     _UINT32_(3) 
#define PINMUX_PC30D_SERCOM6_PAD0                  ((PIN_PC30D_SERCOM6_PAD0 << 16) | MUX_PC30D_SERCOM6_PAD0)
#define PORT_PC30D_SERCOM6_PAD0                    (_UINT32_(1) << 30)

#define PIN_PC31D_SERCOM6_PAD1                     _UINT32_(95)
#define MUX_PC31D_SERCOM6_PAD1                     _UINT32_(3) 
#define PINMUX_PC31D_SERCOM6_PAD1                  ((PIN_PC31D_SERCOM6_PAD1 << 16) | MUX_PC31D_SERCOM6_PAD1)
#define PORT_PC31D_SERCOM6_PAD1                    (_UINT32_(1) << 31)

#define PIN_PG00D_SERCOM6_PAD2                     _UINT32_(192)
#define MUX_PG00D_SERCOM6_PAD2                     _UINT32_(3) 
#define PINMUX_PG00D_SERCOM6_PAD2                  ((PIN_PG00D_SERCOM6_PAD2 << 16) | MUX_PG00D_SERCOM6_PAD2)
#define PORT_PG00D_SERCOM6_PAD2                    (_UINT32_(1) << 0)

#define PIN_PG01D_SERCOM6_PAD3                     _UINT32_(193)
#define MUX_PG01D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PG01D_SERCOM6_PAD3                  ((PIN_PG01D_SERCOM6_PAD3 << 16) | MUX_PG01D_SERCOM6_PAD3)
#define PORT_PG01D_SERCOM6_PAD3                    (_UINT32_(1) << 1)

/* ========== PORT definition for SERCOM7 peripheral ========== */
#define PIN_PD14D_SERCOM7_PAD0                     _UINT32_(110)
#define MUX_PD14D_SERCOM7_PAD0                     _UINT32_(3) 
#define PINMUX_PD14D_SERCOM7_PAD0                  ((PIN_PD14D_SERCOM7_PAD0 << 16) | MUX_PD14D_SERCOM7_PAD0)
#define PORT_PD14D_SERCOM7_PAD0                    (_UINT32_(1) << 14)

#define PIN_PD15D_SERCOM7_PAD1                     _UINT32_(111)
#define MUX_PD15D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PD15D_SERCOM7_PAD1                  ((PIN_PD15D_SERCOM7_PAD1 << 16) | MUX_PD15D_SERCOM7_PAD1)
#define PORT_PD15D_SERCOM7_PAD1                    (_UINT32_(1) << 15)

