Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz8110ca90176.h
#define PIN_PG01H_SQI1_DATA2                       _UINT32_(193)
#define MUX_PG01H_SQI1_DATA2                       _UINT32_(7) 
#define PINMUX_PG01H_SQI1_DATA2                    ((PIN_PG01H_SQI1_DATA2 << 16) | MUX_PG01H_SQI1_DATA2)
#define PORT_PG01H_SQI1_DATA2                      (_UINT32_(1) << 1)

#define PIN_PG02H_SQI1_DATA3                       _UINT32_(194)
#define MUX_PG02H_SQI1_DATA3                       _UINT32_(7) 
#define PINMUX_PG02H_SQI1_DATA3                    ((PIN_PG02H_SQI1_DATA3 << 16) | MUX_PG02H_SQI1_DATA3)
#define PORT_PG02H_SQI1_DATA3                      (_UINT32_(1) << 2)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PC00F_TCC0_WO0                         _UINT32_(64)
#define MUX_PC00F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PC00F_TCC0_WO0                      ((PIN_PC00F_TCC0_WO0 << 16) | MUX_PC00F_TCC0_WO0)
#define PORT_PC00F_TCC0_WO0                        (_UINT32_(1) << 0)

#define PIN_PC01F_TCC0_WO1                         _UINT32_(65)
#define MUX_PC01F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PC01F_TCC0_WO1                      ((PIN_PC01F_TCC0_WO1 << 16) | MUX_PC01F_TCC0_WO1)
#define PORT_PC01F_TCC0_WO1                        (_UINT32_(1) << 1)

#define PIN_PC02F_TCC0_WO2                         _UINT32_(66)
#define MUX_PC02F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PC02F_TCC0_WO2                      ((PIN_PC02F_TCC0_WO2 << 16) | MUX_PC02F_TCC0_WO2)
#define PORT_PC02F_TCC0_WO2                        (_UINT32_(1) << 2)

#define PIN_PC03F_TCC0_WO3                         _UINT32_(67)
#define MUX_PC03F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PC03F_TCC0_WO3                      ((PIN_PC03F_TCC0_WO3 << 16) | MUX_PC03F_TCC0_WO3)
#define PORT_PC03F_TCC0_WO3                        (_UINT32_(1) << 3)

#define PIN_PC04F_TCC0_WO4                         _UINT32_(68)
#define MUX_PC04F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PC04F_TCC0_WO4                      ((PIN_PC04F_TCC0_WO4 << 16) | MUX_PC04F_TCC0_WO4)
#define PORT_PC04F_TCC0_WO4                        (_UINT32_(1) << 4)

#define PIN_PC05F_TCC0_WO5                         _UINT32_(69)
#define MUX_PC05F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PC05F_TCC0_WO5                      ((PIN_PC05F_TCC0_WO5 << 16) | MUX_PC05F_TCC0_WO5)
#define PORT_PC05F_TCC0_WO5                        (_UINT32_(1) << 5)

#define PIN_PC06F_TCC0_WO6                         _UINT32_(70)
#define MUX_PC06F_TCC0_WO6                         _UINT32_(5) 
#define PINMUX_PC06F_TCC0_WO6                      ((PIN_PC06F_TCC0_WO6 << 16) | MUX_PC06F_TCC0_WO6)
#define PORT_PC06F_TCC0_WO6                        (_UINT32_(1) << 6)

#define PIN_PC07F_TCC0_WO7                         _UINT32_(71)
#define MUX_PC07F_TCC0_WO7                         _UINT32_(5) 
#define PINMUX_PC07F_TCC0_WO7                      ((PIN_PC07F_TCC0_WO7 << 16) | MUX_PC07F_TCC0_WO7)
#define PORT_PC07F_TCC0_WO7                        (_UINT32_(1) << 7)

/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_PB10F_TCC1_WO0                         _UINT32_(42)
#define MUX_PB10F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PB10F_TCC1_WO0                      ((PIN_PB10F_TCC1_WO0 << 16) | MUX_PB10F_TCC1_WO0)
#define PORT_PB10F_TCC1_WO0                        (_UINT32_(1) << 10)

#define PIN_PB11F_TCC1_WO1                         _UINT32_(43)
#define MUX_PB11F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PB11F_TCC1_WO1                      ((PIN_PB11F_TCC1_WO1 << 16) | MUX_PB11F_TCC1_WO1)
#define PORT_PB11F_TCC1_WO1                        (_UINT32_(1) << 11)

#define PIN_PB12F_TCC1_WO2                         _UINT32_(44)
#define MUX_PB12F_TCC1_WO2                         _UINT32_(5) 
#define PINMUX_PB12F_TCC1_WO2                      ((PIN_PB12F_TCC1_WO2 << 16) | MUX_PB12F_TCC1_WO2)
#define PORT_PB12F_TCC1_WO2                        (_UINT32_(1) << 12)

#define PIN_PB13F_TCC1_WO3                         _UINT32_(45)
#define MUX_PB13F_TCC1_WO3                         _UINT32_(5) 
#define PINMUX_PB13F_TCC1_WO3                      ((PIN_PB13F_TCC1_WO3 << 16) | MUX_PB13F_TCC1_WO3)
#define PORT_PB13F_TCC1_WO3                        (_UINT32_(1) << 13)

#define PIN_PB14F_TCC1_WO4                         _UINT32_(46)
#define MUX_PB14F_TCC1_WO4                         _UINT32_(5) 
#define PINMUX_PB14F_TCC1_WO4                      ((PIN_PB14F_TCC1_WO4 << 16) | MUX_PB14F_TCC1_WO4)
#define PORT_PB14F_TCC1_WO4                        (_UINT32_(1) << 14)

#define PIN_PB15F_TCC1_WO5                         _UINT32_(47)
#define MUX_PB15F_TCC1_WO5                         _UINT32_(5) 
#define PINMUX_PB15F_TCC1_WO5                      ((PIN_PB15F_TCC1_WO5 << 16) | MUX_PB15F_TCC1_WO5)
#define PORT_PB15F_TCC1_WO5                        (_UINT32_(1) << 15)

#define PIN_PB16F_TCC1_WO6                         _UINT32_(48)
#define MUX_PB16F_TCC1_WO6                         _UINT32_(5) 
#define PINMUX_PB16F_TCC1_WO6                      ((PIN_PB16F_TCC1_WO6 << 16) | MUX_PB16F_TCC1_WO6)
#define PORT_PB16F_TCC1_WO6                        (_UINT32_(1) << 16)

#define PIN_PB17F_TCC1_WO7                         _UINT32_(49)
#define MUX_PB17F_TCC1_WO7                         _UINT32_(5) 
#define PINMUX_PB17F_TCC1_WO7                      ((PIN_PB17F_TCC1_WO7 << 16) | MUX_PB17F_TCC1_WO7)
#define PORT_PB17F_TCC1_WO7                        (_UINT32_(1) << 17)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PD10F_TCC2_WO0                         _UINT32_(106)
#define MUX_PD10F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PD10F_TCC2_WO0                      ((PIN_PD10F_TCC2_WO0 << 16) | MUX_PD10F_TCC2_WO0)
#define PORT_PD10F_TCC2_WO0                        (_UINT32_(1) << 10)

#define PIN_PD11F_TCC2_WO1                         _UINT32_(107)
#define MUX_PD11F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PD11F_TCC2_WO1                      ((PIN_PD11F_TCC2_WO1 << 16) | MUX_PD11F_TCC2_WO1)
#define PORT_PD11F_TCC2_WO1                        (_UINT32_(1) << 11)

#define PIN_PD12F_TCC2_WO2                         _UINT32_(108)
#define MUX_PD12F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PD12F_TCC2_WO2                      ((PIN_PD12F_TCC2_WO2 << 16) | MUX_PD12F_TCC2_WO2)
#define PORT_PD12F_TCC2_WO2                        (_UINT32_(1) << 12)

#define PIN_PA04F_TCC2_WO3                         _UINT32_(4) 
#define MUX_PA04F_TCC2_WO3                         _UINT32_(5) 
#define PINMUX_PA04F_TCC2_WO3                      ((PIN_PA04F_TCC2_WO3 << 16) | MUX_PA04F_TCC2_WO3)
#define PORT_PA04F_TCC2_WO3                        (_UINT32_(1) << 4)

#define PIN_PA03F_TCC2_WO4                         _UINT32_(3) 
#define MUX_PA03F_TCC2_WO4                         _UINT32_(5) 
#define PINMUX_PA03F_TCC2_WO4                      ((PIN_PA03F_TCC2_WO4 << 16) | MUX_PA03F_TCC2_WO4)
#define PORT_PA03F_TCC2_WO4                        (_UINT32_(1) << 3)

#define PIN_PA02F_TCC2_WO5                         _UINT32_(2) 
#define MUX_PA02F_TCC2_WO5                         _UINT32_(5) 
#define PINMUX_PA02F_TCC2_WO5                      ((PIN_PA02F_TCC2_WO5 << 16) | MUX_PA02F_TCC2_WO5)
#define PORT_PA02F_TCC2_WO5                        (_UINT32_(1) << 2)

/* ========== PORT definition for TCC3 peripheral ========== */
#define PIN_PA05F_TCC3_WO0                         _UINT32_(5) 
#define MUX_PA05F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PA05F_TCC3_WO0                      ((PIN_PA05F_TCC3_WO0 << 16) | MUX_PA05F_TCC3_WO0)
#define PORT_PA05F_TCC3_WO0                        (_UINT32_(1) << 5)

#define PIN_PA06F_TCC3_WO1                         _UINT32_(6) 
#define MUX_PA06F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PA06F_TCC3_WO1                      ((PIN_PA06F_TCC3_WO1 << 16) | MUX_PA06F_TCC3_WO1)
#define PORT_PA06F_TCC3_WO1                        (_UINT32_(1) << 6)

